server/artillery/test.yml
config:
  target: "http://localhost:5007"
  http:
    # Responses have to be sent within 60 seconds or the request will be aborted
    timeout: 30
  phases:
    - duration: 60
      arrivalRate: 500
  payload:
    path: "userId.csv"
    fields:
      - "userId"
scenarios:
  -
    name: "user info for the GET APIs"
    flow:
    -
      get:
        url: "/users/{{userId}}"
    # -
    #   get:
    #     url: "/users/{{userId}}/id"
    # -
    #   get:
    #     url: "/users/{{userId}}/super"